Revit 2024 API
TriangulatedSolidOrShell Members
The TriangulatedSolidOrShell type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TriangulatedSolidOrShell
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetShellComponent
 Returns the specified shell component of a solid or shell. Input componentIndex must lie between 0 and ShellComponentCount-1, inclusive. The returned TriangulatedShellComponent should not be modified by the caller.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShellComponentCount
 The number of TriangulatedShellComponents that this TriangulatedSolidOrShell contains.
See Also
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace